//---------------------------------------------------------------------------

#pragma hdrstop

#include "StrConsts.h"
//---------------------------------------------------------------------------


extern CSSTR BeginCryptBlock[];
extern CSSTR EndCryptBlock[];



//*****************************************************
// GetStr - Функция расшифровывает строку EncryptedStr
//*****************************************************
string GetStr(const char* EncryptedStr)
{
	string Result = EncryptedStr;

	bool Encrypted = !Result.IsEmpty() && EncryptedStr > BeginCryptBlock &&
					 EncryptedStr < EndCryptBlock && EncryptedStr[0] != 'C' &&
					 BeginCryptBlock[0] != 'C';

	if (Encrypted)
	{
		// Расшифровываем строку

    }

	return Result;
}
//-----------------------------------------------------------------------------

// Включаем выравнивание данных в один байт
#pragma pack(push, 1)






CSSTR BeginCryptBlock[] = "CSBEGIN";
//=============================================================================
//  Блок хранения шифрованных строк.
//  Все строки находящиеся ниже и до определения
//  CSEND
//  будут шифроваться билдером
//=============================================================================


CSSTR BotWorkPath[] = "WnsBMT"; // Рабочий каталог бота
CSSTR GrabberPath[] = "gdata";  // Имя рабочей папки грабера













//=============================================================================
// Конец блока шифрованных строк
//=============================================================================
CSSTR EndCryptBlock[] = "CSEND";

#pragma pack(pop)
