//---------------------------------------------------------------------------

#pragma hdrstop

#include "KeyLogger.h"
#include "BotCore.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)





TInfiniteKeyLogger::TInfiniteKeyLogger()
{

}
//----------------------------------------------------------------------------

TInfiniteKeyLogger::~TInfiniteKeyLogger()
{

}
//----------------------------------------------------------------------------

//--------------------------------------------
//  Activate - Функция активирует глобальный
//             кейлогер
//--------------------------------------------
bool static TInfiniteKeyLogger::Activate()
{

}
//----------------------------------------------------------------------------

//--------------------------------------------
//  Activated - Функция возвращает истину если
//             кейлогер активирован
//--------------------------------------------
bool static TInfiniteKeyLogger::Activated()
{

}
//----------------------------------------------------------------------------
