//---------------------------------------------------------------------------
//  ћодуль хранени€ настроек системы зборки автозалива
//
//  верси€ 1.0
//  дата: март 2012
//---------------------------------------------------------------------------

#ifndef AzConfigH
#define AzConfigH
//---------------------------------------------------------------------------


#include "Strings.h"

//----------------------------------------------------------
// ћаксимальный размер буфера хранени€ ссылок системы AZ
//----------------------------------------------------------
#define AZ_HOSTS_SIZE 512


// ‘ункци€ возвращает первый рабочий хост из
// массива хостов системы AZ
string GetAzHost();

//---------------------------------------------------------------------------
#endif
