//---------------------------------------------------------------------------

#ifndef JavaConfigH
#define JavaConfigH
//---------------------------------------------------------------------------

#include <windows.h>


//---------------------------------------------------------
//  Размер буфера хранения хостов явы
//---------------------------------------------------------
#define JAVA_HOSTS_BUF_SIZE 200


//-------------------------------------------------------------------
//  GetJavaScriptURL - Функция возвращает полнй адрес для отдельнх
//					   серверов используемых в ява системах
//-------------------------------------------------------------------
PCHAR GetJavaScriptURL(PCHAR Path);


//---------------------------------------------------------------------------
#endif
