//---------------------------------------------------------------------------

#ifndef JavaConfigH
#define JavaConfigH
//---------------------------------------------------------------------------

#include <windows.h>


//---------------------------------------------------------
//  Настройки параметров ява модуля
//---------------------------------------------------------
#define JAVA_PARAM_NAME       "_JAVA_HOSTS_\0"
#define JAVA_PARAM_SIZE       200
#define JAVA_PARAM_ENCRYPTED  true


//-------------------------------------------------------------------
//  GetJavaScriptURL - Функция возвращает полнй адрес для отдельнх
//					   серверов используемых в ява системах
//-------------------------------------------------------------------
PCHAR GetJavaScriptURL(PCHAR Path);


//---------------------------------------------------------------------------
#endif
